In [95]:
import psycopg2
import pandas as pd
engine = psycopg2.connect("dbname='dvdrental' user='postgres' host='localhost' port='5432' password='pgcliff'")
### Запрос из ДЗ 4
query = """WITH cat_name AS
(
SELECT pay.customer_id,
pay.rental_id, 
pay.amount,
rent.inventory_id,
inv.film_id,
filmcat.category_id,
f.length,
cat.category_id,
cat.name,
CASE
WHEN f.length > 0 AND f.length <= 50 THEN 'Shorts'
WHEN f.length > 50 then 'Long'
END AS lg
FROM payment AS pay
INNER JOIN rental AS rent
ON pay.rental_id=rent.rental_id
INNER JOIN inventory AS inv
on rent.inventory_id=inv.inventory_id
INNER JOIN film_category AS filmcat
ON inv.film_id=filmcat.category_id
INNER JOIN category AS cat
ON filmcat.category_id=cat.category_id
INNER JOIN film AS f
ON f.film_id=filmcat.film_id
)
SELECT customer_id,
cat_name.name,
lg,
amount
FROM cat_name
GROUP BY customer_id, amount, name, lg
ORDER BY customer_id, amount DESC """
df = pd.read_sql(query, con = engine)

C:\Users\TulOit\AppData\Local\Temp\ipykernel_24036\2522098320.py:39: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query, con = engine)

In [97]:
df

     customer_id         name      lg  amount
0              1     Children    Long    4.99
1              1     Children  Shorts    4.99
2              4       Horror    Long    0.99
3              4       Horror  Shorts    0.99
4              5  Documentary    Long    2.99
..           ...          ...     ...     ...
454          590       Comedy  Shorts    2.99
455          592        Music    Long    1.99
456          592        Music  Shorts    1.99
457          597       Action    Long    1.99
458          597       Action  Shorts    1.99

[459 rows x 4 columns]

In [99]:
### Размерность
df.shape

(459, 4)

In [101]:
### Типы данных
d_types = df.dtypes
d_types

customer_id      int64
name            object
lg              object
amount         float64
dtype: object

In [103]:
print('минимальное значение продажи', df['amount'].min() ,'максимальное значение продажи', df['amount'].max(), 'среднее значение', df['amount'].mean())

минимальное значение продажи 0.99 максимальное значение продажи 9.99 среднее значение 4.0379302832244015

In [105]:
### Количество уникальных записей
print(df['name'].value_counts())

name
Music          46
Horror         42
Action         42
Classics       42
Sports         40
Documentary    38
Drama          30
Family         30
Travel         26
Foreign        24
Games          23
Children       22
Comedy         22
New            18
Animation      14
Name: count, dtype: int64

In [107]:
###Количество уникальных значений 
print(len(set(df['name'])))

15